#!/usr/bin/env python
# -*- coding: utf-8 -*-
'''
Задание 5.2a

Всё, как в задании 5.2, но, если пользователь ввел адрес хоста, а не адрес сети,
надо преобразовать адрес хоста в адрес сети и вывести адрес сети и маску, как в задании 5.2.

Пример адреса сети (все биты хостовой части равны нулю):
* 10.0.1.0/24
* 190.1.0.0/16

Пример адреса хоста:
* 10.0.1.1/24 - хост из сети 10.0.1.0/24
* 10.0.5.1/30 - хост из сети 10.0.5.0/30

Если пользователь ввел адрес 10.0.1.1/24,
вывод должен быть таким:

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

net = input("Enter IP (address/mask): ")

net = net.split('.')
net.extend(net.pop().split('/'))

print('Network:')

s_net = '{:08b}'.format(int(net[0])) + \
        '{:08b}'.format(int(net[1])) + \
        '{:08b}'.format(int(net[2])) + \
        '{:08b}'.format(int(net[3]))

s_net = s_net[0:int(net[-1])] + '0' * (32 - int(net[-1])) 

print('{:<10}'.format(int(s_net[0:8], 2)),
      '{:<10}'.format(int(s_net[8:16], 2)),
      '{:<10}'.format(int(s_net[16:24], 2)),
      '{:<10}'.format(int(s_net[24:], 2)),
      '\n',
      '{:8}'.format(s_net[0:8]), '  ',
      '{:8}'.format(s_net[8:16]), '  ',
      '{:8}'.format(s_net[16:24]), '  ',
      '{:8}'.format(s_net[24:]), '\n',
      sep='')

print('Mask:')

print('/', net[4], sep = '')

mask = '1' * int(net[4]) + '0' * (32 - int(net[4]))
print('{:<10}'.format(int(mask[0:8], 2)),
      '{:<10}'.format(int(mask[8:16], 2)),
      '{:<10}'.format(int(mask[16:24], 2)),
      '{:<10}'.format(int(mask[24:], 2)),
      sep = '')

print('{:08b}'.format(int(mask[0:8], 2)), '  ',
      '{:08b}'.format(int(mask[8:16], 2)), '  ',
      '{:08b}'.format(int(mask[16:24], 2)), '  ',
      '{:08b}'.format(int(mask[24:], 2)), '  ',
      sep = '')

